jhonatan-goncalves-pereira/pulsopnaat/sdkconfig.defaults
# ==========================================
# Configurações Padrão do Projeto PulsoPNAAT
# (Arquivo seguro para versionamento no Git)
# ==========================================

# 1. Target do Chip (Garante que todos usem ESP32-S3)
CONFIG_IDF_TARGET="esp32s3"

# 2. Hardware e Pinagem (Pode ser compartilhado, não é senha)
CONFIG_PULSOPNAAT_RPM_NOMINAL=1500
CONFIG_PULSOPNAAT_LED_R_GPIO=39
CONFIG_PULSOPNAAT_LED_G_GPIO=40
CONFIG_PULSOPNAAT_LED_B_GPIO=41
CONFIG_PULSOPNAAT_BUZZER_GPIO=42
CONFIG_PULSOPNAAT_BOTAO_CALIBRACAO_GPIO=0

# 3. Configurações de Build e Partição
# Firmware completo (Wi-Fi + MQTT + FATFS) passa de 1 MB: a tabela "large" reserva 1,5 MB para o app
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Nomes de log (log_AAAAMMDD_HHMMSS.csv) não cabem em 8.3: sem LFN o fopen falha com EINVAL
CONFIG_FATFS_LFN_HEAP=y

# Callbacks de Wi-Fi/IP rodam na task sys_evt; 2304 B (padrão) não comporta os logs da reconexão (RNF05)
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# 4. Configurações de Rede (Deixadas em BRANCO por segurança)
# Cada desenvolvedor preencherá isso localmente no menuconfig
CONFIG_WIFI_SSID=""
CONFIG_WIFI_PASSWORD=""
CONFIG_MQTT_BROKER_URI="mqtt://localhost:1883"
